Repository: osahris/rps-portal
Catalog: enduser/wiki.*.po
Languages: de

source: The wiki is used to centrally collect information, for example on the usage and administration of the IT system.
de: Im Wiki werden zentral Informationen gesammelt, unter anderem zur Benutzung und zur Administration des IT-Systems.

source: The wiki is reachable at address <https://...> .
de: Das Wiki läuft unter der Adresse <https://...> .

source: Registering a user account
de: Benutzer-Account registrieren

source: You can change any page in the wiki yourself. If you do not yet have a wiki account, please create one yourself by clicking the "Edit" link on the top left of any wiki page. After another click on the "Register" button, enter a new user name and password. Including an email address in your registration is optional. However, without an email address on file, the wiki system cannot automatically inform you about events of interest to you, such as changes to certain pages.
de: Sie können selber beliebige Seiten des Wikis verändern. Erstellen Sie sich dazu (soweit noch nicht vorhanden) selbständig einen Account durch Klicken des "Edit"-Links oben auf einer beliebigen Seite. Im zweiten Schritt muss dann auf "Register" geklickt und ein beliebiger Nutzername und ein Passwort ausgesucht werden. Die Angabe einer Email-Adresse ist optional; ohne die Adresse kann das Wiki-System Sie allerdings nicht über bestimmte Vorkommnisse automatisiert informieren.

source: Editing pages
de: Seiten editieren

source: To edit an existing page, click the "edit" link above the main page text. You will reach the Editor page, which displays the markup text of the page-to-be-edited in a large editing area. Usually this will be in [[Markdown format|ikiwiki/markdown]]. The page [[Formatting wiki pages|ikiwiki/formatting]] contains some tipps on using this format.
de: Um eine vorhandene Seite zu editieren, klicken Sie auf "Edit" oberhalb des Seitentextes. Sie gelangen auf die Editier-Seite, in dem der Text der zu editierenden Seite in einem großen Text-Feld erscheint. Üblicherweise wird er im [[Markdown-Format|ikiwiki/markdown]] gehalten sein. Die Seite [[Wiki-Seiten formatieren|ikiwiki/formatting]] enthält einige Tipps zum Umgang mit diesem Format.

source: Once you are finished editing, use the "Preview" button to render a preview of the modified text. Any mistakes in markdown formatting will quickly become obvious this way. If everything looks fine to you, please enter a short description on what you changed into the single line below the main text field (e.g "completed list of pterosaurs"). Finally, klick on "Save Page". Our sincere thanks, you have successfully contributed to the wiki.
de: Wenn Sie das Editieren abgeschlossen haben, sollten Sie über den Knopf "Preview" eine Voransicht des Textes erstellen und diese begutachten. Fehler in der Markdown-Formatierung werden so schnell offensichtlich. Wenn Alles in Ordnung ist, geben Sie in der einzelnen Textzeile unterhalb des großen Eingabefeldes noch eine Beschreibung dazu ein, was Sie verändert haben (z.B. "Liste der Flugsaurier vervollständigt"). Klicken Sie nun abschließend auf "Save Page". Herzlichen Dank, Sie haben erfolgreich zum Wiki beigetragen.

source: Creating new pages
de: Neue Seiten erstellen

source: Once in a while, you will come accross a reference text, which is not itself a link. Instead a small question mark appears next to the link. This will look like in the following example:
de: Manchmal werden Sie im Wiki auf einen Referenz-Text stoßen, der kein Link ist. Stattdessen erscheint neben dem Link ein kleines Fragezeichen. Das sieht dann zum Beispiel so aus:

source: [[Catalogue of known plesiosaurs|plesiosaurs]]
de: [[Verzeichnis der bekannten Plesiosaurier|plesiosaurs]]

source: To create a wiki page from such a placeholder, just click on the little question mark. Next, using the "Page location" chooser, select where the new page should be within the wiki's hierarchy. The actual editing of the pages happens as described above. The page should be created in English, and possibly be [[translated|translate]] afterwards.
de: Um eine solche Seite zu erstellen, klicken Sie einfach auf das Fragezeichen. Als nächstes Wählen Sie unter "Page location" aus, wie die Seite einzuordnen ist. Das eigentliche Editieren des Textes funktioniert wie oben beschrieben. Die Seite sollte zunächst auf Deutsch erstellt, und später gegebenenfalls [[übersetzt|translate]] werden.
